{
    "title": "Machine Learning Engineer - ML Ops",
    "company": "Regrello",
    "description": "Machine Learning Engineer - ML OpsRole\n\nRegrello is seeking proactive and industry-experienced US-based Machine Learning Engineers to join our AI-research team. In this role, you will bridge the gap between our top-tier Machine Learning Researchers and Software Engineers, moving fluidly between both disciplines to steward our groundbreaking Machine Learning and AI capabilities to real users in production. Together with your team members, you will lead the productionalization of our novel foundational deep learning model that is specifically designed for processing large, complex tabular datasets. The ideal candidate will have several years of experience bringing deep learning models to fruition in an industry setting, with a well-developed intuition about how to best make it happen.\n\nBy joining our team, you will have the opportunity to contribute to the advancement of manufacturing practices on a global scale. You will be at the forefront of creating cutting-edge solutions that have a direct impact on how organizations optimize manufacturing and supply chain processes.\n\nThis is an individual contributor role, with the potential to take on additional responsibilities in the future.\nCompany\n\nRegrello is a 60-person startup reimagining automation in supply chains, in which companies still communicate about $13T of annual shipments almost entirely via email. This is a $220-billion, Amazon-sized market opportunity that’s been largely overlooked for over 20 years. Our team has experience building billion-dollar companies and includes veterans from Oracle, Palantir, Apple, Amazon, and Microsoft. Our customers include some of the largest electronics manufacturers in the world. We're funded by Andreessen Horowitz, Tiger Global, Dell, Bloomberg, and Ram Sriram (first investor in Google). With a 2-3 year runway, we offer startup agility and longer-term stability.\nProduct\n\nWe are building a global operating network that finally enables supply-chain companies to collaborate within one platform. Our workflow engine empowers non-technical industry experts to model their complex manufacturing and operational processes. Our forms engine enables unprecedented data exchange between companies. Our AI engine monitors the complex goings-on across thousands of workflows, identifies inefficiencies, and drives optimization in a constantly-shifting supply chain landscape. Quote one user: ”I’ve been waiting for this for 20 years.”\nCulture and Compensation\n\nWe are a customer-obsessed, product-driven company that is building a flexible, hybrid/remote culture to enable the brightest minds in the industry. We are particularly interested in candidates based in our hubs of Seattle, San Francisco, and New York, but we will consider candidates who live anywhere in the US. We have industry-leading compensation packages, including equity and health benefits.\nAbout you\n• Bachelors in Computer Science or Software Engineering with a 3.5+ GPA.\n• 3+ years of industry experience architecting MLOps pipelines for Deep Learning models.\n• Strong understanding of training models in distributed multi-node GPU environments.\n• Experienced with data engineering technologies, such as Airflow, Spark, Trino, Flink, or BigQuery.\n• Familiarity with Python and PyTorch, Tensorflow, or JAX.\n• Excellent written and verbal communication skills, capable of articulating complex technical concepts to diverse audiences.\n• A strong desire to learn, grow, and drive impact on real global problems—and to help others around you do the same.\n• Non-requirement: You don't need any experience with supply chain or manufacturing—we'll teach you that part!\nResponsibilities\n• Manage the deployment of AI models to solve real-world complex problems in global supply chain and manufacturing.\n• Collaborate with cross-functional teams including Engineering, Design, Product Management, and industry experts to build high-quality product features that can be used by major companies around the world.\n• Take on new challenges and responsibilities as needed, and be an enthusiastic team player in a dynamic startup environment.\n• Help shape the company by participating in hiring decisions and contributing to our culture of continuous learning and growth.",
    "url": null,
    "date_saved": "2025-11-25 12:02:10"
}